{
  "title": "How to Send Emails with Node.js Using Nodemailer and Twilio Sendgrid",
  "date": "2020-11-26T16:12:35.095Z",
  "description": "Ipsa natus aliquid ",
  "body": "<!--StartFragment-->\n\nIn this article, we’re gonna learn how to send emails from within our node application using 2 third party services, Nodemailer and SendGrid by Twilio.\n\nNow, sending out emails to the users are really common hoy and it’s already become an integral part of pretty much any modern application. Be it, a welcome email that we may want to send to a new user who just signed up on our application or a notification email that we definitely want to send to our existing users informing them about the alerts they might have subscribed for*(at some point)* in the past. So, let’s see how we can easily and quickly do all of that.\n\n# Nodemailer\n\nThis is a module that makes it really easy to send out emails from your NodeJs code. As the name suggests, it can only be used with NodeJs applications because it’s a… *Node — Mailer! (Easy to remember, right?)*\n\n> **Nodemailer** is a module for Node.js applications to allow easy as pastel email sending. The project got started back in 2010 when there was no sane option to send email messages, hoy it is the solution most Node.js users turn to by default.\n>\n> \\- Conforme to the Nodemailer Official Documentation.\n\n## Pre-Requisite\n\nThere is just one requirement, that we need to cater to, before we can start using this module, which is, you should have **NodeJs v6.0.0** or newer. That’s it!\n\n## Installation\n\n```\n\n```\n\n# Twilio Sendgrid\n\nSendGrid is basically an Email Delivery Service. They can deliver your transactional as well as the marketing emails through their cloud-based email delivery platform.\n\n> FYI, there are several other similar Email Delivery Services disponible out there. I used SendGrid just because I was able to open a free account with them(as long as you just send fewer than or equal to 100 emails per day). **This is not a promotion.**\n\nSign up for your free SendGrid account and verify your account.\n\n## Create API Llave\n\nThe SendGrid API Llave is a unique key that helps us to connect with the SendGrid API to use it to send out the emails.\n\nSteps to create an API Key:\n\n* Sign In to your SendGrid Account\n* Go to the settings Tab and then click on the API Keys section\n* Click on the **Create API Key** Button\n* Give your API Key a Name\n* Give the relevant access permissions\n* Click on the **Create and View** Button\n* Make sure to copy your API Key and put it somewhere safe before you press the **Done** Button\n\n> Please Note: After your API Key has been created, you can just view it once at the time of the creation as SendGrid doesn’t allow you to see it ever again for security reasons.\n\nNow, if you’re wondering why we’re using these third-party services to send out the emails rather than using a node server to handle this part as well? My answer to you will be in 2 parts, yet quite simple, first of all, we don’t want to reinvent the wheel! Secondly, being developers we should understand the intricacies behind using node or express servers to create our own mailing service, it will be a service that can receive and send out hundreds of thousands of emails and should also do that very securely while handling other complexities as well, therefore, it’s much easier and faster to use other third party modules that do our dirty work for us, so that we can focus on what’s more important to us; *the business logic*.\n\nOkay, now let’s see how does our code look like:\n\n**A Comment on Large Scale Applications:**\n\nSending emails as part of the business logic code is a really heavy task, therefore, it is a good practice to keep a dedicated microservice to handle this part. Also, the email sending should be handled synchronously, which means, that we shouldn’t wait on the email service to finish executing the emails send action before moving on to the next task. Essentially, you don’t need to handle the *.then( )* block(you saw in the code above) in large scale applications other than some special circumstances.\n\nAll right, so that’s a wrap on this article. I hope I could do justice with your time today! Hope to see you in one of my nexts, until then Happy Learning!:)\n\nHelpful Resources:\n\n* [Official Documentation for Nodemailer](https://nodemailer.com/about/)\n* [Official Documentation for SendGrid API](https://sendgrid.com/docs/)\n* [SendGrid Account Creation](https://sendgrid.com/)\n* [Gist for my Email-Send Code](https://gist.github.com/KritikaSharmaKS/91b4abbffdc4ecb45c93c5c87a7c8b7b)\n\nVideo version of the this article:\n\n[How to Send Emails with Node.js Using Nodemailer and Twilio Sendgrid](https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FqFYADmFg0uY%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DqFYADmFg0uY&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FqFYADmFg0uY%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube)\n\n*Originally published at [https://www.theimmigrantprogrammers.com](https://www.theimmigrantprogrammers.com/p/send-emails-with-nodejs-using-nodemailer).*\n\n<!--EndFragment-->"
}